tyeth/circuitpython/ports/espressif/boards/adafruit_metro_esp32s3/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "Adafruit Metro ESP32S3"
#define MICROPY_HW_MCU_NAME         "ESP32S3"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO46)

#define MICROPY_HW_LED_STATUS (&pin_GPIO13)

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO48)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO47)

#define DEFAULT_SPI_BUS_SCK (&pin_GPIO39)
#define DEFAULT_SPI_BUS_MOSI (&pin_GPIO42)
#define DEFAULT_SPI_BUS_MISO (&pin_GPIO21)

#define DEFAULT_UART_BUS_RX (&pin_GPIO41)
#define DEFAULT_UART_BUS_TX (&pin_GPIO40)

#define DOUBLE_TAP_PIN (&pin_GPIO38)

// Bench finding: 32 KB of IDF headroom is not enough for a softAP that also
// serves TLS -- handshakes hit MemoryError and DHCP replies fail while the
// Python heap still reports free space. 40 KB is what the C6 hub needed.
#define CIRCUITPY_ESP_RADIO_HEAP_RESERVE (40 * 1024)
